<template>
  <div class="car-step">
    <h2 class="title">Мы ценим Ваше время и комфорт!<br>Запишитесь на сервис Nissan онлайн</h2>
    <ul class="advantages">
      <li>
        <div class="advantages-icon">
          <svg width="143" height="84" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M113.978 82.447c5.123 0 9.276-4.333 9.276-9.679 0-5.345-4.153-9.679-9.276-9.679-5.124 0-9.277 4.334-9.277 9.68 0 5.345 4.153 9.678 9.277 9.678zM113.978 18.766c-2.34-1.594-6.35.16-8.954 3.933-2.593 3.773-2.8 8.12-.461 9.725" stroke="#C3002F" stroke-width="2.307" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/><path d="M99.689 74.684l-58.931.367s.265-17.271-12.78-17.363c-13.044-.092-15.672 10.872-14.012 17.546.173 2.099-11.823-1.1-12.169-4.472.07-.264-2.362-14.072 5.6-19.461 0 0 6.776-4.599 28.959-5.39 0 0 22.298-14.071 26.389-14.186 4.206-1.766 54.206-4.817 66.282-.837 4.287.78-.668 1.938-1.198 2.052 0 0 10.221 9.863 11.155 12.306.53 2.075.23 10.298.173 10.653.057 1.824 2.396 6.09 2.396 7.856 0 0 .703 10.355-14.715 9.197-.173-3.222-.38-10.172-7.871-13.612-4.701-2.168-10.221-1.308-13.943 2.385-2.431 2.397-4.517 6.33-4.966 12.752" fill="#fff"/><path d="M99.689 74.684l-58.931.367s.265-17.271-12.78-17.363c-13.044-.092-15.672 10.872-14.012 17.546.173 2.099-11.823-1.1-12.169-4.472.07-.264-2.362-14.072 5.6-19.461 0 0 6.776-4.599 28.959-5.39 0 0 22.298-14.071 26.389-14.186 4.206-1.766 54.206-4.817 66.282-.837 4.287.78-.668 1.938-1.198 2.052 0 0 10.221 9.863 11.155 12.306.53 2.075.23 10.298.173 10.653.057 1.824 2.396 6.09 2.396 7.856 0 0 .703 10.355-14.715 9.197-.173-3.222-.38-10.172-7.871-13.612-4.701-2.168-10.221-1.308-13.943 2.385-2.431 2.397-4.517 6.33-4.966 12.752" stroke="#C3002F" stroke-width="2.307" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/><path d="M119.221 38.239s-8.492 6.399-11.731 6.766c-3.238.367-48.905 4.105-59.737 2.04M26.86 82.447c5.123 0 9.277-4.333 9.277-9.679 0-5.345-4.154-9.679-9.277-9.679-5.123 0-9.276 4.334-9.276 9.68 0 5.345 4.153 9.678 9.276 9.678zM14.842 52.218c.173.275-3.595 5.573-11.558 5.757M130.859 41.037c0 .607-5.37 4.747-5.37 5.481s3.446 2.317 3.849 2.5c.403.184 7.767.126 9.518-1.1" stroke="#C3002F" stroke-width="2.307" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/><path d="M112.169 22.803l9.91-.264-.081-.08 12.354-11.032L125.847 2l-12.353 11.02-1.325 9.783z" fill="#fff"/><path d="M112.169 22.803l9.91-.264-.081-.08 12.354-11.032L125.847 2l-12.353 11.02-1.325 9.783z" stroke="#C3002F" stroke-width="2.307" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/><path d="M116.329 18.181c3.134 2.363 2.558 8.36-1.279 13.395-3.838 5.034-9.484 7.202-12.618 4.84" stroke="#C3002F" stroke-width="2.307" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/></svg>
        </div>
        <p class="advantages-txt">Узнайте о выгодных сервисных предложениях Nissan именно для вашего автомобиля</p>
      </li>
      <li>
        <div class="advantages-icon">
          <svg width="118" height="82" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M43.477 43.764c0-10.688-9.265-19.358-20.696-19.358-11.431 0-20.696 8.67-20.696 19.358 0 3.245.853 6.296 2.362 8.98.023.056.046.102.08.16l.047.08c.265.447.542.883.841 1.307l7.79 12.168 8.735 13.647c.38.584 1.29.584 1.66 0l8.734-13.647 7.536-11.766c2.282-3.108 3.607-6.87 3.607-10.93z" stroke="#C3002F" stroke-width="2.307" stroke-miterlimit="10" stroke-linejoin="round"/><path d="M22.793 58.225c7.643 0 13.84-6.166 13.84-13.773 0-7.607-6.197-13.773-13.84-13.773-7.644 0-13.84 6.166-13.84 13.773 0 7.607 6.196 13.773 13.84 13.773zM116.823 18.844c0-6.835-5.923-12.374-13.217-12.374-7.294 0-13.217 5.54-13.217 12.374 0 2.076.541 4.025 1.51 5.734.01.034.022.069.045.103l.035.046c.161.287.346.562.541.837l4.967 7.776 5.577 8.715a.638.638 0 001.061 0l5.577-8.715 4.817-7.524c1.452-1.983 2.304-4.38 2.304-6.972z" stroke="#C3002F" stroke-width="2.307" stroke-miterlimit="10" stroke-linejoin="round"/><path d="M103.607 28.087c4.888 0 8.85-3.943 8.85-8.807 0-4.864-3.962-8.808-8.85-8.808s-8.85 3.944-8.85 8.808 3.962 8.807 8.85 8.807z" stroke="#C3002F" stroke-width="2.307" stroke-miterlimit="10" stroke-linejoin="round"/><path d="M62.502 8.867C62.502 4.521 58.734 1 54.09 1c-4.644 0-8.412 3.52-8.412 7.867a7.421 7.421 0 00.99 3.704l.024.034c.103.184.219.356.346.54l3.168 4.942 3.55 5.54c.15.24.518.24.68 0l3.549-5.54 3.065-4.782a7.552 7.552 0 001.452-4.438z" stroke="#C3002F" stroke-width="1.73" stroke-miterlimit="10" stroke-linejoin="round"/><path d="M54.09 14.245c2.833 0 5.129-2.284 5.129-5.103 0-2.818-2.296-5.103-5.128-5.103-2.832 0-5.128 2.285-5.128 5.103 0 2.819 2.296 5.104 5.128 5.104z" stroke="#C3002F" stroke-width="1.846" stroke-miterlimit="10" stroke-linejoin="round"/><path d="M50.31 26.47c-20.891 4.404 82.566 17.558 38.547 19.496 0 0-80.238 7.27 14.07 21.192 15.868 2.34-20.155 7.695-75.133 13.464" stroke="#C3002F" stroke-width="2.307" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/></svg>

        </div>
        <p class="advantages-txt">Выберите дилера, который вам подходит</p>
      </li>
      <li>
        <div class="advantages-icon">
          <svg width="106" height="75" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M60.484 27.52s25.375.459 29.938-.654c1.326-.32 5.635-5.011 5.635-5.011s-.564 3.945.75 4.357c1.301.413 2.8-.366 2.8-.366s2.604 6.387-1.072 7.316c-2.512.63-8.355 2.523-11.789 3.658a10.082 10.082 0 00-3.987 2.5c-.933.952-2.34 2.076-4.137 2.603-2.984.872-17.803.792-17.803.792" stroke="#C3002F" stroke-width="1.73" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/><path d="M60.83 39.722s5.888.16 8.411-.54c3.238-.894 8.55-11.238 13.068-11.616M103.305 47.394s.208 19.312-1.659 21.261c-1.867 1.95-10.636 1.204-11.282.562-.645-.654-.553-4.794-.553-4.794" stroke="#C3002F" stroke-width="1.73" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/><path d="M60.484 50.72s19.521.08 20.673.217c4.714.585 9.576 5.459 12.665 5.78 5.277.562 8.573-.929 8.573-.929" stroke="#C3002F" stroke-width="1.73" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/><path d="M27.435 18.105S36.987 4.24 38.68 2.635c.07-.07.139-.127.208-.196 2.316-2.328 3.93-1.204 4.275-.906a.201.201 0 00.173.058s13.874-.333 17.93-.344c4.564-.023 18.276.344 18.276.344.07 0 .127-.023.173-.058.346-.298 1.96-1.422 4.276.906.069.07.138.138.207.195 1.452 1.377 8.735 11.835 10.74 14.725.138.207.472.103.472-.149.012-1.158.23-3.108 1.579-3.612 1.867-.711 6.718.722 7.191.871.023.012.057.023.08.035.208.16 1.072 1.112-.818 4.77-.011.012-.011.035-.023.046-.415.516-1.314.837-5.439.78-.219 0-.346.252-.207.424.84 1.02 3.019 3.727 4.816 6.434 2.282 3.429 1.775 16.273.139 23.6v.012c-1.118 7.087-1.256 11.216-2.132 11.892-.864.677-5.716 3.406-13.114.93-7.398-2.478-32.335-1.354-35.043-.953" stroke="#C3002F" stroke-width="1.73" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/><path d="M62.328 17.795l-30.918-.23c-.034-.986 8.7-13.646 10.118-13.715.76-.046 19.428-.31 19.613-.31 2.362.07 19.451.264 20.223.31 1.418.08 9.899 12.053 9.899 13.05-.023 1.56-28.935.895-28.935.895zM62.408 27.52s-25.374.458-29.937-.654c-1.037-.252-3.918-3.2-5.117-4.45a.262.262 0 00-.45.195c.093 1.17.116 3.303-.817 3.601-.98.31-2.075-.046-2.547-.252a.26.26 0 00-.346.15c-.438 1.203-2.063 6.238 1.176 7.052 2.535.642 8.423 2.546 11.846 3.681a9.777 9.777 0 013.895 2.454c.933.964 2.35 2.099 4.16 2.626 2.984.872 17.803.792 17.803.792" stroke="#C3002F" stroke-width="1.73" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/><path d="M62.063 39.722s-5.889.16-8.412-.54c-3.239-.894-8.55-11.238-13.068-11.616M62.409 50.72s-19.52.08-20.673.217c-4.713.585-9.576 5.459-12.664 5.78-5.278.562-8.574-.929-8.574-.929" stroke="#C3002F" stroke-width="1.73" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/><path d="M60.15 43.816c0 15.79-12.872 28.6-28.74 28.6-15.867 0-28.74-12.81-28.74-28.6 0-15.792 12.873-28.601 28.74-28.601 15.868 0 28.74 12.798 28.74 28.6z" fill="#fff"/><path d="M31.41 72.416c15.873 0 28.74-12.805 28.74-28.6 0-15.796-12.867-28.601-28.74-28.601-15.872 0-28.74 12.805-28.74 28.6 0 15.796 12.868 28.601 28.74 28.601z" stroke="#C3002F" stroke-width="3.46" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/><path d="M19.092 43.15c3.503 3.452 9.76 13.017 10.002 12.982.3-.046 3.987-14.713 11.132-22.488" fill="#fff"/><path d="M19.092 43.15c3.503 3.452 9.76 13.017 10.002 12.982.3-.046 3.987-14.713 11.132-22.488" stroke="#C3002F" stroke-width="3.46" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/></svg>
        </div>
        <p class="advantages-txt">Выберите актуальные для вас сервисные предложения</p>
      </li>
      <li>
        <div class="advantages-icon">
          <svg width="88" height="90" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M41 2v11.284h13.321" fill="#fff"/><path d="M41 2v11.284h13.321M17.18 26.209h29.512M17.18 35.2h29.512M17.18 44.179h29.512M17.18 53.766h29.512M17.18 62.746h29.512M17.18 71.736h29.512M11.35 26.209h.08M11.35 35.2h.08M11.35 44.179h.08M11.35 53.766h.08M11.35 62.746h.08M11.35 71.736h.08" stroke="#C3002F" stroke-width="2.307" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/><path d="M55 81.576H2.144V2H41l6.66 5.642 6.66 5.642.68 68.292z" stroke="#C3002F" stroke-width="2.307" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/><path d="M86.275 66.083c0 12.247-9.98 22.179-22.287 22.179-12.307 0-22.286-9.932-22.286-22.18 0-12.247 9.98-22.178 22.287-22.178 12.307 0 22.286 9.931 22.286 22.179z" fill="#fff"/><path d="M63.977 88.262c12.308 0 22.286-9.93 22.286-22.179 0-12.25-9.978-22.179-22.286-22.179-12.309 0-22.287 9.93-22.287 22.179 0 12.249 9.978 22.179 22.287 22.179z" stroke="#C3002F" stroke-width="3.46" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/><path d="M57.12 66.186c2.155 2.133 6.015 8.027 6.165 8.004.184-.023 2.455-9.07 6.857-13.864" fill="#fff"/><path d="M57.12 66.186c2.155 2.133 6.015 8.027 6.165 8.004.184-.023 2.455-9.07 6.857-13.864" stroke="#C3002F" stroke-width="3.46" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/></svg>
        </div>
        <p class="advantages-txt">Отправьте дилеру данные о вашем автомобиле в форме удобной анкеты</p>
      </li>
    </ul>
    <p class="car-step-description">Вы также можете сохранить информацию о доступных для вашего автомобиля сервисных
      кампаниях на компьютере, распечатать или отправить на электронную почту.</p>
  </div>

</template>

<script>
export default {
  name: "Car",
}
</script>

<style lang="scss" scoped>
.st0 {
  fill: #C3002F;
}

.car-step {
  text-transform: uppercase;
  margin-top: 70px;
}

.car-step-description {
  font-size: 16px;
  text-align: center;
  border-bottom: 1px solid #EFEFEF;
  padding-bottom: 40px;
  margin-bottom: 40px;
  @media (min-width: 768px) {
    font-size: 20px;
  }
}

.advantages {
  list-style: none;
  text-align: center;
  margin-bottom: 50px;
  @media (min-width: 768px) {
    display: flex;
    flex-wrap: wrap;
    padding: 0 40px;
    justify-content: space-between;
    margin-bottom: 16px;
  }
  @media (min-width: 1024px) {
    flex-wrap: nowrap;
    padding: 0;
  }

  li {
    width: 270px;
    margin: 0 auto;
    @media (min-width: 768px) {
      width: 41.04%;
    }
    @media (min-width: 1024px) {
      margin: 0;
      flex: 1 0 0;
    }
    @media (min-width: 1280px) {
      width: 270px;
      flex: none;
    }
  }

  &-icon {
    margin-bottom: 34px;
  }

  &-txt {
    margin-bottom: 34px;
  }
}


.title {
  font-size: 24px;
  line-height: 34px;
  font-weight: 300;
  position: relative;
  margin-bottom: 40px;

  &:before {
    content: '';
    width: 72px;
    height: 4px;
    background: #C3002F;
    position: absolute;
    left: 0;
    top: -16px;
  }

  @media (min-width: 768px) {
    font-size: 48px;
    line-height: 67px;
  }
}
</style>
